Repository: mozilla-l10n/mt-training-data
Catalog: btv/btv_pontoon.tmx
Source language: en_us
Languages: btv

source: Media and Entertainment
btv: میڈیا آ مزہ

source: Medumba
btv: میڈمبا

source: Meetei Lon
btv: میٹی لان

source: Message
btv: جواب

source: Michoacán Mazahua
btv: مائکوشئن مزاہوا

source: Mingrelian
btv: مینگریلیئن

source: Minimum sentences in file: 1000
btv: کم نو کم جملے فائل مہ : 1000

source: [Mismatched content]
btv: [میلائ نہ ھویں والہ مشتملات]

source: Misreadings
btv: غلطی

source: Missing an 's' at the end of a word.
btv: لفظ سو آخری مہ 'ایس' دھیر گا

source: Missing an <strong>'s'</strong> at the end of a word.
btv: یک غلطی <strong> 'ایس' </strong> لفظ سو اخیر مہ۔

source: Missing 'A' or 'The' at the beginning of the recording.
btv: ریکارڈنگ سو شرو مہ مہ 'اے' یا 'دی،،' دھر گا

source: Missing <strong>'A'</strong> or <strong>'The'</strong> at the beginning of the recording.
btv: غلطی <strong>ٰ ٰاےٰ </strong> یا <strong> ٰ دی ٰ </strong> ریکاڈنگ سو شروع مہ۔

source: Missing the end of the last word by cutting off the recording too quickly.
btv: ریکاڈنگ ڙھو ھَلہ کٹ گرو اخری لفظ غلط گرو۔

source: Mixed
btv: گڈ وَڈ

source: Mixteco Yucuhiti
btv: میکسٹیکو یوکوہتی

source: Mokpwe
btv: موکپوی

source: Moksha
btv: موکشا

source: Mongolian
btv: منگولی

source: More
btv: جَل

source: [More has been recorded than the required text]
btv: ضرورت نو زیات سبق ریکاڈ گیگی

source: Mossi
btv: موسی

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Common Voice, a project to help make voice recognition open and accessible to everyone.
btv: گھیئں سو زریعہ رے استعمال ھویں والہ زیات تر ڈیٹا لوں سو اکثریت سو دَن مجود نہ تھو بے سوچ گرہ تھہ کاں چہ بدعت دباؤ گرا۔اِس وجہ رے اسو عام اواز سو پراجیکٹ شرو گیو تھو کاں چہ اواز سندے مہ مدد سو دَن یک پراجکٹ تھوپُھنیانک ہر یک سو دَن کھولاو تھو

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Project Common Voice, a project to help make voice recognition open to everyone.
btv: گھیئں سو زریعہ رے استعمال ھویں والہ زیات تر ڈیٹا لوں سو اکثریت سو دَن مجود نہ تھو بے سوچ گرہ تھہ کاں چہ بدعت دباؤ گرا۔اِس وجہ رے اسو عام اواز سو پراجیکٹ شرو گیو تھو کاں چہ اواز سندے مہ مدد سو دَن یک پراجکٹ تھوپُھنیانک ہر یک سو دَن کھولاو تھو

source: Most recordings are of people talking in their natural voice. You can accept the occasional non-standard recording that is shouted, whispered, or obviously delivered in a ‘dramatic’ voice. Please reject sung recordings and those using a computer-synthesized voice.
btv: زیات تر ریکاڈنگ تیوں لوں سو ھواں چہء سے اپئیں قدرتی اواز مہ بیاد گرہ تھہ ۔توس کدی کدی غیر معیاری ریکاڈنگ قبول گر ھون تہ چہء کاں چیغ دے تہ ،پُھش پُھش گرہ تھہ،یا واضحہ ڈرامائ اواز مہ اڑا تھہمہربانی گیری گائ والہ آ کمپیوٹر مہ ترتیب دیتیل اواز استعمال گرے والہ لو رد گریا

source: Mozilla Common Voice is an initiative to help teach machines how real people speak.
btv: مزیلا عام اواز یک اقدام تھو پڑے سو مشین سو مدد سو دَن چہ حقیقی لو کش منہ تھہ

source: Mozilla Common Voice is made possible by a diverse community of activists, linguists, data scientists, academics and software engineers from all over the world. The project is stewarded by the Mozilla Foundation.
btv: موزیلا عام اواز ممکن سنداں بزائ مختلف کمیونٹی سو ایکٹیوسٹوں رے،زیب سو ماہروں رے،سائنسدانوں رے تعلیمی آ سافٹ وئیر انجنئیروں رے تمام دنیاں سو۔پراجیکٹ موزیلا فاونڈیشن چلا۔

source: Mozilla Common Voice is the world’s most diverse crowdsourced open speech dataset - and we’re powered entirely by donations. It costs almost a million dollars a year to host the datasets and improve the platform for the 100+ language communities who rely on what we do. If you value open, inclusive data - <b>donate today!</b>
btv: موزیلا عام اواز دنیا سو بوٹونو متنوع گھنڑہ سو اوپم ڈیٹا سیٹ سو زریعہ تھی آ بے خیراتی دے سو زریعہ رےپور متنوع سو طاقت رڇھہ تہ ڈیٹا سیٹ سو میلمستیا گرے گرے آ 100 نو زیات زیب سو کمیونٹی سو پلیٹ فارم مڑنئ سندے سو دن یک کال مہ تقریباً دش لاکھ ڈالر خرچہ یا چہء سو اسیئں کموں رے انحصار گرہ کہ تو کھلے عام ،شامل ڈیٹا سو قدر گرا ۔

source: Mozilla’s open source voice recognition engine Deep Speech can be used to build speech recognition applications. Read our <githubLink>Github overview</githubLink> or join the <discourseLink>DeepSpeech Discourse</discourseLink> to learn how to get started.
btv: مزیلا سو کھولاو زریعہاواز سو پھنیانک انجن ڈونگ تقریرے تقریر سو پھنیانک سو اپلیکیشن سندے سو دن ھوں ھواں۔<githubLink> گٹ ھب جائزہ</githubLink> یا شامل ھوں <discourseLink> ڈونگ تقریر ڈسکورس</discourseLink> شرو گرے سو طریقہ ڇھیڇئ۔

source: Mutual accountability.
btv: باہمی حساب کتاب۔

source: n
btv: این

source: N
btv: این

source: Name
btv: ناں

source: Nature and Environment
btv: قدرت آ ماحول

source: Nepali
btv: نیپالی

source: New Language Launch
btv: نئزیب دُھن

source: News and Current Affairs
btv: خبرے آ حاضر حالات

source: Next
btv: پَروں

source: Ngiembon
btv: نجیبن

source: Nias
btv: نیاس

source: Nigerian Pidgin English
btv: نائجیریئن پیجن انگریزی

source: NKo
btv: نکو

source: No
btv: نہء

source: [No ‘a’ in the original text]
btv: [اصل لکیل مہ "اے" نہ تھو ]

source: <noCopyright>No copyright</noCopyright> restrictions (cc-0)
btv: <noCopyright> نقل نہ گر </noCopyright>ممنوع ( )

source: No foreign letters
btv: نہ بھار سو حروف

source: No information
btv: کیں معلومات نہ تھی

source: No information available
btv: کیں معلومات مجود نہ تھی

source: No microphone found.
btv: مائیکرو فون نہ ڇو۔

source: No numbers and special characters
btv: نمبر آ خاص نشان نہء

source: Northern Hindko
btv: شمالی ہندکو

source: Northern Sotho
btv: شمالی سوتھو

source: Northwest Gbaya
btv: شمال مغربی گبایا

source: Norwegian Bokmål
btv: ناروئین بوکمال

source: Norwegian Nynorsk
btv: ناروئین نینورسک

source: No sentences to review. <addLink>Add more sentences now!</addLink>
btv: نظر ثانی سو دَن جملے نہ تھے <addLink> ھویں جل جملے شامل گر</addLink>

source: Note: When set to 'Visible', this setting can be changed from the <profileLink>Profile page</profileLink>
btv: نوٹ: کدی چہء موجودگی سیٹ گی; او سیٹنگ بدل ھوں ھاں <profileLink> پروفائل صفہ نو</profileLink>

source: No Thanks
btv: نہء شکریہ

source: No thanks, continue speaking
btv: نہء مہربانی، منو جاری رڇھ

source: Not use, or solicit, harmful or offensive language
btv: استعمال نہ گر، یا درخواست، نقصان دہ یا جارحانہ زیب

source: Now that you know a little bit more about Common Voice, why not try it out? Click on the microphone icon to start reading sentences aloud. <br/><br/>If you prefer to review other people's voice contributions, click on the play icon. You’ll help confirm that recordings match the sentences written on screen.
btv: ھویں تو عام اواز سو بارہ ڇوں ڙھؤ پَزا تہ چئیں نہ اِس رے ازمیخ گری جملے اوچت اواز رے پڑھے شروگرے سو دَن مائیکروفون سو نشان رے کلک گر <br/> کہ تو جَ ل لوں سو اواز سو جائزہ گِھنے یےترجیح دیا تہ پلے سو نشان رے کلک گر تو اِس بیاد سو تصدیق گرے مہ مدد گرونݜ چہ ریکارڈنگ سکرین رے لیکیل جملیوں مِل ملاو ھواں

source: Now you can donate your voice to help us build an open-source voice database that anyone can use to make innovative apps for devices and the web. Read a sentence to help machines learn how real people speak. Check the work of other contributors to improve the quality. It’s that simple!
btv: ھویں تو اوازے کھولاو سورس اواز سو ڈیٹا بیس سندے مہ مدد سو دَن خیراتی دے ھواں سو کاں زو استعمال گر ھواں اوازار زو ویب سو دَن ناں ایپس سندے سو دَن مشینو یے او پُھنے مہ مدد سو دَن یک جملہ پڑھ چہ حقیقی لو کش مہ نہ تھہ پرئیں سو کام چیک گرمعیار سَم سندے سو دَن حصہ گھنے والہ۔ او اِت ہسان تھو

source: Nubi
btv: نُبی

source: Number of Voices
btv: اوازوں سو تعداد

source: Numbers
btv: نمبر

source: Occitan
btv: اوسیٹان

source: Odia
btv: اودیا

source: Offensive Content
btv: جارحانہ مواد

source: Offensive content or sensitive information
btv: جارحانہ مواد یا حساس معلومات

source: Offensive language
btv: غصہ ناک زیب

source: Offensive speech
btv: غصہ ناک تقریر

source: Offline Sources
btv: آف لائن زرائع

source: On desktop devices you can contribute by downloading…
btv: ڈسک ٹاپ ڈیوائس رے تو ڈون لوڈنگ سو زریعہ رے حصہ گ،ِھن ھواں…

source: On his head he wore a beret.
btv: تِس اپئیں ݜئیݜ رے یک فوجی ٹوپے ݜئن تھی

source: On iOS please continue with Safari to enable recording…
btv: iOS رے مہربانی گیری سفاری مل جاری گر ریکاڈنگ سو قابل گر

source: On the other hand, if you think that the reader has never come across the word before, and is making an incorrect guess at the pronunciation, please reject. If you are unsure, use the skip button.
btv: پَریئں طرف کی تو پَزا چہ قاری اول نو لفظ رے نہ یا آ تلفظ مہ غلط سوچ گرامہربانی گیری رد گر ، کہ تو مطمئین نہ تھو، سکپ سو بٹن استعمال گر۔

source: On the other hand, if you think that the reader has probably never come across the word before, and is simply making an incorrect guess at the pronunciation, please reject. If you are unsure, use the skip button.
btv: پرئیں طرف نو کہ تُو پرزا چہء پڑے والہ یقینی طور رے لفظ رے نہ یا آ سادگی رے غلط تلفظ قیاس گرا تہ مہربانی گیری رد گیرے اگر کہ تیوں یقین نہ تھو، سکپ بٹن استعمال گر

source: Ormuri
btv: ارموری

source: Ossetian
btv: اوسیشئین

source: Other Language
btv: پرئیں زیب

source: Other people validate those voice clips.
btv: جَل لو تیوؤں اواز سو کلپ سو تصدیق گرہ تھہ۔

source: Other voice datasets…
btv: پروں اواز سو ڈیٹا سیٹ…

source: Other Voice Datasets
btv: پروں اواز سو ڈیٹا سیٹ

source: Our governance is founded on the pillars of:
btv: اسئیں حُکمت تھویئں رے سندیل تھی:

source: Overall Accuracy
btv: تمام درستگی

source: Overall Hr. Total
btv: بوٹ Hr مجموعی

source: p
btv: پی

source: Paiwan
btv: پائیوان

source: Palula
btv: پلولا

source: Papantla Totonac
btv: پاپانٹلا ٹوٹونیک

source: Papiamento
btv: پاپیامینٹو

source: Papiamento (Aruba)
btv: پاپیامنٹو (اروبہ)

source: Partner
btv: ملگرے

source: Partners
btv: مَلگرے

source: Partnerships and networks
btv: ملگرتیا آ نیٹ ورک

source: [Part of the text can’t be heard]
btv: [لکیل سو حصہ ݜؤآں نہ بزا]

source: Pashto
btv: پختو

source: <p>Common Voice is a publicly available voice dataset, powered by the voices of volunteer contributors around the world. People who want to build voice applications can use the dataset to train machine learning models.</p> <p>At present, most voice datasets are owned by companies, which stifles innovation. Voice datasets also underrepresent: non-English speakers, people of colour, disabled people, women and LGBTQIA+ people. This means that voice-enabled technology doesn’t work at all for many languages, and where it does work, it may not perform equally well for everyone. We want to change that by mobilising people everywhere to share their voice.</p>
btv: عام اواز یکعوام سو دن مجود معلوماتی سیٹ تھو ،چاپیرا دنیا مہ رضاکارانہ حصہ گھنے والوں اسئ طاقت دیتھ تھی۔کاں لو چہء اواز سو اپلیکیشن سندُو لوکھہ تھہ سے او معلوماتی سیٹ مشین لرننگ ماڈل سو ماہر ھونتہ</p><p> موجودہ وخت مہ زیات تر معلوماتی سیٹ کمپنیوں اپوؤں گیگی تھو چہء سو تبدیلی ورٹا۔عام اواز سو سیٹ غیر انگریز ، رنگین لو،معزورہ لو اَ دِھبیں اَ +LGBTQIA لو ،اِمطلب او تھی چہء او اواز سو ٹیکنالوجی ڙھؤ زیبوں رے صحیح کام نہ گرا۔ آ کوزا چی او کام گرا،او ہر کسئ یکشان کام نہ گر ھاں،بے بدلُو لوکھہ تھہ چہء لو اپیئں اواز ہر زئ اوڑے سو دن تکڑہ ھئیں بزیاں</p>

source: People come and contribute their voices.
btv: لو یا تھہ اَپئیں اوز شریک گرہ تھہ۔

source: Persian
btv: فارسی

source: Personal dashboards keep you up-to-date with individual and community progress.
btv: ذاتی ڈیش بورڈ تی خبردار رڇھا انفرادی آ کمیونٹی سو کارکردگی نو۔

source: <playbookLink>Find helpful guidance</playbookLink> on the entire Common Voice journey, from localisation to dataset usage, as well as how to connect with our community.
btv: <playbookLink> مدد گار رہنمائ ٹنڈ </playbookLink> عام اواز سو اندر سفر مہ، لوکلائزیشن نو ڈیٹا سیٹ سو استعمال تکے اِس میل میل اسیئں کمیونٹی میل کش میلونݜ۔

source: <playIcon></playIcon>Last one!
btv: آخری یک/playIcon> <playIcon>

source: Play/Stop
btv: چالو/بند

source: Please check our <templateFileLink>template file</templateFileLink>. Your sentences should be copyright free (CC0 or permissioned original work by the submitter) and be clear, grammatically correct and easy to read. Submitted sentences should take roughly 10-15 seconds to read and should avoid including numbers, proper nouns and special characters.
btv: مہربانی گیریچیک گر اسوں <templateFileLink> ٹمپلیٹ فائل</templateFileLink> تیں جملے نقل گرے سو ایجازت نو ازاد ( 0çc یا ایجازت ھوئینل اصل کام جمہ گرے والہ سو زریعہ گِھن) آ صاف ھوں ، گرائمر سو لحاظ رے صحیح آ پڑے اسان۔ جمہ ھوئینل جملے 10-15 سیکنڈ سرسری پڑو آ شامل گریل نمبر دُر گرو، خاص ناں آ سپیشل ٹِکے۔

source: Please fill out this field.
btv: مہربانی گیری او زائے پور

source: Please select a language to review sentences.
btv: مہربانی گیری جملیوں سو نظر ثانی گرے سو دَن زیب خوش گر

source: Polish
btv: پالش

source: <pontoonAccountLink>Create an account</pontoonAccountLink> if you don’t have one. Then, choose your language <strong>(‘Team’)</strong> and then choose the project, <pontoonCvLink>Common Voice</pontoonCvLink>. There will be files to translate. Click on one, then it shows words in English and a box to translate them.
btv: <pontoonAccountLink> یک اکاؤنٹ سَن</pontoonAccountLink> اگر کہ تیوں نہ تھو۔نُٹ اپیئں زیب س <strong> ٹیم خوش گر</strong> اَ نُٹ پراجیکٹ خوش گر، <pontoonCvLink> عام اواز </pontoonCvLink> تیزا ترجمہ سو دَن فائل ھویانݜ۔ یک رے کلک گر ، نُٹ او انگلش سو الفاظ پشا اَ یک باکس تسیئں ترجمہ سو دَن

source: Portuguese
btv: پرتگائی

source: Press play, listen & tell us: did they accurately speak the sentence below?
btv: دباؤ گر چلا، ݜؤں آ اسئ مَن :ایوں څھے سو جملےصحیح من گے؟

source: Press { shortcut-play-toggle } to toggle play mode
btv: دباؤ گر { shortcut-play-toggle } ٹوگل پلے موڈ سو دَن

source: Privacy
btv: پردہ داری

source: Privacy, security and transparency.
btv: پردہ داری،حفاظت آ شفافیت۔

source: Pro
btv: پرو

source: Process / Steps
btv: عمل/ سٹپ

source: Profile
btv: پروفائل

source: Profile information improves the audio data used in training speech recognition accuracy.
btv: پروفائل سو معلومات تربیت تقریر سو پُھنیانک سو درستگی مہاستعمال ھویں والہ آڈیو ڈیٹا سَم سندہ تھہ۔

source: Public Domain
btv: عوامی احاطہ کار

source: Pular Guinea
btv: پولرگائنیا

source: Punctuation
btv: وقف

source: Punjabi
btv: پنجابی

source: Puno Quechua
btv: پَنو کیچوا

source: Quechua Ambo-Pasco
btv: کیوچوا امبوپاسکو

source: Quechua Arequipa-La Unión
btv: کیوچوا آرکیوپا۔لایونین

source: Quechua Cajatambo
btv: کیچوا کاجاتمبو

source: Quechua Chanka
btv: کیوچوا چنکا

source: Quechua Chiquián
btv: کیوچوا چیکوائن

source: Quechua Corongo Ancash
btv: کیوچوا کارونگوآنکش

source: Quechua Jauja Wanka
btv: کیوچوا جواجہ وانکہ

source: Quechua Pasco Santa Ana de Tusi
btv: کیوچوا پاسکو سانتا آنہ دی توسی

source: Quechua Sihuas Ancash
btv: کیوچوا سیہواس آنکش

source: Quechua Yauyos
btv: کیوچوایایوس

source: Question Collection
btv: سوال جمع گرو

source: Questions which are very culturally specific, or make a lot of assumptions about the responder
btv: سے سوال چہ کاں ڙھؤ ثقافتی طور رے خاص تھا، یا جواب دے والہ سو دَن مفروضے سَندہ تھہ

source: Questions which may cause someone to share sensitive, potentially triggering responses
btv: اش سوال چہ تویئں وجہ دے کسئ حساس، ممکنہ طور رے متحرک ردعمل سو شرکت گر ھونتہ

source: Questions which might solicit hate speech or other biased or offensive sentiments
btv: سے سوال چہ کاں نفرت والہ تقریر یا جَل تعصب یا جارحانہ جزبات سو درخواست گرہ تھہ

source: Questions which might solicit personally identifiable information
btv: سے سوال چہ کاں ذاتی طور رے قابل شناخت معلومات طلب گر ھونتہ

source: Questions which require someone to list several steps. Listing steps prompts the user to recite an answer rather than a more natural response.
btv: سے سوال چہ تویں ڙھؤ سٹپ سو ضرورت ھویں سٹپ سو لسٹ استعمال گرے والہ اشارہ دیتہ جواب منے سو ڙھؤ قدرتی رد عمل سو زارے

source: Questions which someone would struggle to respond to in 15 seconds (the maximum clip length)
btv: سے سوال چہ تسوئیں جواب سو دَن کاں 15 سیکنڈ مہ حوشش گرے (زیات نہ زیات کلپ سو ڙیگیار)

source: r
btv: آر

source: [‘Raised’ in English is always pronounced as one syllable, not two]
btv: [ازئ] اگریزی مہ ہمیشہ یک سلیبس مہ منا بزا دو مہ نئ]

source: Reach out to governments, non-profits or media organizations to see whether any of their web content, reports or other content can be dedicated to the public domain
btv: حکومت،غیر منافع بخش یا میڈیا تنظیمو تکے اوڑ۔ چئیں چہ اوبھال چہ اویں ویب مواد،رپورٹ یا جَل مواد عوامی احاطہ کار سو دَن وقف ھوں ھواں کہ نیئ

source: Reader Effects
btv: پڑے والہ سو اثرات

source: Reading all the words on the page correctly does matter. When listening, check very carefully that what has been recorded is exactly what has been written; reject if they have added, contracted or missed words.
btv: صفحہ رے تمام الفاظ صحیح پڑاؤ گرو اھم تھو ݜؤویں سو وخت احتیاط رے چیک گر چہ چوں صحیح طریقہ رے ریکارڈ ھوں چوں لیکید، رد گر کہ سے جمع ھوی گے تھا کنٹریکٹڈ یا الفاظ دھریل ھ وندا

source: Reading contractions that aren't actually there, such as "We're" instead of "We are", or vice versa.
btv: کھٹآں لفظ پڑُو چہء سےء حقیقت مہ تِیزہ نہ ھوویں لکہ چہء "بے تھا" سو زائرے "بے تھا" یا اش جَل۔

source: Read More
btv: جںل پڑھ

source: Read Sentences
btv: جملے پَڑ

source: Read Sentences, Answer Questions
btv: جملے پَڑ، سوال جواب

source: Read Sentences <small>(Coming soon)</small>
btv: جملے پَڑ <small> (ھَلہ مہ یا) </small>

source: Read sentences submitted by the community in various languages
btv: جملے پڑ کاں چہء کمیونٹی مختلف زیبوں مہ جمہگے تھے

source: Read the sentence carefully - don’t miss, change or add words.
btv: جملے احتاط گِھن پڑ۔څھور نئں،بدل نہ گر اَ لفظ شامل نہ گر۔

source: Ready to add your voice or lend your ear?
btv: اپئیں اواز شامل گرے سو شؤویں سو دن تیار ھوں

source: Ready to contribute?
btv: حصہ گِھنے سو دَنتیار ھوں

source: Ready to donate your voice?
btv: اپئیں اواز دے سو دَن تیار تھو ؟

source: Ready to help validate sentences?
btv: جملیوں سو تصدیق مہ مدد سو دَن تیار ھوں

source: Receive emails such as challenge and goal reminders, progress updates, and newsletters about Common Voice.
btv: مشکلات آ مقصد سو ای میل حاصل گر،پراگرس، اپڈیٹ آخبریوں سو خط عام اواز سو بارہ مہ

source: Recorded Clips
btv: ریکاڈ ھونئیل کلپ

source: Recorded Hours
btv: رکاڈ ھویئنل گھنٹے

source: <recordIcon></recordIcon> Last one!
btv: <recordIcon> </recordIcon> اخیری یک

source: [Recording cut off before the end of the last word]
btv: [اخری لفظ نختم ھویں نو اول ریکاڈنگ کٹ گرو]

source: Recordings
btv: ریکاڈنگ

source: Recording voice clips is an integral part of building our open dataset; some would say it's the fun part too.
btv: ریکارڈنگ اواز سو کلپ اسوں کھولاو ڈیٹا سیٹ سو سندے سو یک لازمی حصی تھی۔ کیں مَنیانݜ چہء او ھُم مزہ گِھنیئ سو حصہ تھی

source: Record/Stop
btv: ریکاڈ/ سٹاپ

source: Record yourself reading sentences in your language
btv: امئ ریکاڈ گر اپیئں زیب مہ پڑے والہ جملے

source: Record yourself responding to questions and prompts in your language
btv: اپئیں طرف نو سوالوں سو جواب ریکاڈ گر آ فورًا اپیئں زیب مہ

source: Record your voice
btv: اپئیں اواز ریکاڈ گر

source: Reference the source of your sentence (required)
btv: اپئیں جملہ سو زریعہ سو حالہ دے (ضرورت تھی)

source: Reject
btv: رَد

source: Report
btv: رپورٹ

source: Report was passed successfully
btv: رپرٹ کامیابی رے پاس ھوینگا

source: Request a Language
btv: زیب سو سوال گر

source: *required
btv: *ضروری

source: Re-record
btv: دوبارہ ریکاڈ نگ

source: Re-record clip
btv: کلپ دوبارہ ریکاڈ گر

source: Return
btv: واپس

source: Return here to edit your goal anytime.
btv: ایزئ واپس ھوں ہر کیں وخت مہ زواپئیں مقصدایڈٹ گر

source: Return to Common Voice
btv: عام اواز سو طرفے واپس ھوں

source: Return to Common Voice Datasets
btv: عام اواز سو معلومات سو سیٹ سو طرف واپس ھوں

source: Review
btv: نظرثانی

source: Review could not be saved. Please try again later.
btv: نظرثانی محفوظ نہ ھوں ھواں۔ مہربانی گیری پتن اش کوشش گر۔

source: ⓘ Review Criteria
btv: طرہقہ کار نظر ثانی

source: Review Criteria
btv: طریقہ کار نظر ثانی

source: Reviewed sentences not submitted, are sure?
btv: نظر ثانی گریل جملے جمہ نہ گر، تیوں یقین تھو ؟

source: Review existing sentences submitted by the community
btv: کمیونٹی سو طرف نو جمہ ھونئیل جملیوں سو نظر ثانی

source: Reviewing Sentences
btv: جملیوں سو نظر ثانی گرو

source: Review & re-record clips here as you go
btv: کلپ سو نظرثانی گر ،دوبارہ ریکاڈ گر ایزا کش چہء تو بزا

source: Review & re-record clips if needed
btv: کہ ضرورت تھی تہ کلپ دوبارہ ریکاڈ گر آ نظر ثانی گر

source: Review Sentences
btv: جملیوں سو نظر ثانی گر

source: Review sentences in your language
btv: اپئیں زیب مہ جملے نظر ثانی گر

source: Review & Submit
btv: نظر ثانی آ جمہ گرو

source: Review transcriptions of recorded sentences for accuracy
btv: ریکاڈ گریل جملیوں سو نقلوں سو نظر ثانی گر

source: Review user-submitted transcriptions in your language
btv: اپئیں زیب مہ جمہ گریل نقلوں سو یوزر سو نظر ثانی گر

source: Romanian
btv: رومانی

source: Romansh Sursilvan
btv: رومانش سرسیلوان

source: Romansh Vallader
btv: رومانش والادر

source: Rukai
btv: رکائ

source: Runyankole
btv: رَنیانکول

source: Russian
btv: روسی

source: Ruuli
btv: روولی

source: s
btv: ایس

source: S
btv: ایس

source: Sakha
btv: سکھا

source: Sakizaya
btv: ساکیزایہ

source: Santali (Ol Chiki)
btv: سانتالی (اول چکی)

source: Saraiki
btv: سرائیکی

source: Sardinian
btv: سردینی

source: Scots
btv: سکاٹس

source: Seediq
btv: سیدق

source: Select a Language...
btv: زیب خوش گر

source: Select an option
btv: یک اختیار خوش گر

source: Select a variant (optional)
btv: بدل خوش گر ( اختیاری)

source: Select File
btv: فائل خوش گر

source: Select File to Upload
btv: اپلوڈ گرے سو دَن فائل خوش گر

source: Select the desired language dataset and choose the version you wish to download.
btv: مطلوبہ زیب سو ڈیٹا سیٹ منتخب گر آ سو ورژن منتخب گر کیں سو چہء تو ڈونلوڈ گرو لوکھا

source: Select up to three domains (optional)
btv: ڇا احاطہ تکے خوش گر (اختیاری)

source: Self Citation
btv: ذاتی حوالہ

source: Send sign up link
btv: سائن اپ لنک ڇئی

source: Sentence
btv: جملہ

source: Sentence Collection
btv: جملے جمہ گرو

source: <sentenceCollectorFragment>See more on sentence collection</sentenceCollectorFragment>.
btv: <sentenceCollectorFragment> جملے جمہ گرے رے جل بھال</sentenceCollectorFragment>

source: <sentenceCollectorVideo>Watch our guide on using the Sentence Collector</sentenceCollectorVideo>.
btv: <sentenceCollectorVideo> جملے جمہ گرے رے اسیئںھدایت بھال </sentenceCollectorVideo>

source: Sentence Domain
btv: جملہ سو احاطہ

source: Sentences are collected for people to read aloud.
btv: جملے جمہ ھوئیں گے لوں سو دن چہء اوچت اواز رے پڑیاں۔

source: Sentences are vetted through a community-moderation process, however this process is not perfect. If you see or hear a sentence that offends or upsets you - for example because it violates our <participationGuidelines>community participation guidelines</participationGuidelines> - please do use the flag button in the UI. You can also reach out to us at <emailFragment>commonvoice@mozilla.com</emailFragment>.
btv: کمیونٹی مہ ترمیم سو عمل سو زریعہ جملیوں سو جائزہ گِھنا بزہ ولے او عمل کامل نہ تھی۔ کہ تو اش یک جملہ ریٹھا یا ݜؤاں چہ سو تی پریشان گرا مثال سو طور رے اِسئیں وجہ رے او بیماری <participationGuidelines> کمیونٹی مہ شرکت سو رہنمائی</participationGuidelines> سو خلاف ورزی گرہ مہربانی گر UI. مہ جھنڈہ سو بٹن استعمال گر تو اسو تکے ھُم اوڑ ھواں ۔

source: Sentences contributed here will be added to a publicly available cc-0 licensed dataset.
btv: اِیزا شامل جملے لوں سو دَن جمہ ھوینݜ cc-0 لائسنس یافتہ معلوماتی سیٹ۔
